run/quickTestPar/0/diffO2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "";
    object      diff;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-15;

boundaryField
{
    interconnect0
    {
        type         zeroGradient;
    }
    interconnect0Sides
    {
        type         zeroGradient;
    }
    airInlet
    {
        type         fixedValue;
        value        uniform 1e-15;    //disallow outward diffusion at inlet
                                       // value 0 causes harmonic averaging FPE
    }
    airOutlet
    {
        type         zeroGradient;
    }
    airSides
    {
        type         zeroGradient;
    }
    cathodeSides
    {
        type         zeroGradient;
    }
    cflSides
    {
        type         zeroGradient;
    }
    electrolyteSides
    {
        type         zeroGradient;
    }
    aflSides
    {
        type         zeroGradient;
    }
    anodeSides
    {
        type         zeroGradient;
    }
    fuelInlet
    {
        type         fixedValue;
        value        uniform 1e-15;    //disallow outward diffusion at inlet
                                       // value 0 causes harmonic averaging FPE
    }
    fuelOutlet
    {
        type         zeroGradient;
    }
    fuelSides
    {
        type         zeroGradient;
    }
    interconnect1Sides
    {
        type         zeroGradient;
    }
    interconnect1
    {
        type         zeroGradient;
    }
}


// ************************************************************************* //
