run/quickTestPar/0/fuel/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    fuelInlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    fuelOutlet
    {
        type            zeroGradient;
    }

    fuelSides
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    anodeSides
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    
    aflSides
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
        
    fuel_to_electrolyte //anode
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fuel_to_interconnect1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
