run/quickTestPar/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    interconnect0
    {
        type         zeroGradient;
    }
    interconnect0Sides
    {
        type         zeroGradient;
    }
    airInlet
    {
        type         zeroGradient;
    }
    airOutlet
    {
        type         fixedValue;
        value        uniform 101325;
    }
    airSides
    {
        type         zeroGradient;
    }
    cathodeSides
    {
        type         zeroGradient;
    }
    cflSides
    {
        type         zeroGradient;
    }
    electrolyteSides
    {
        type         zeroGradient;
    }
    aflSides
    {
        type         zeroGradient;
    }
    anodeSides
    {
        type         zeroGradient;
    }
    fuelInlet
    {
        type         zeroGradient;
    }
    fuelOutlet
    {
        type         fixedValue;
        value        uniform 101325;
    }
    fuelSides
    {
        type         zeroGradient;
    }
    interconnect1Sides
    {
        type         zeroGradient;
    }
    interconnect1
    {
        type         zeroGradient;
    }
}


// ************************************************************************* //
