run/quickTestPar/constant/fuel/porousZones
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          porousZones;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
    anode
    {
        coordinateSystem
        {
            e1        (1 0 0);
            e2        (0 0 1); 
        }

        porosity    0.5;

        Cp          Cp [0 2 -2 -1 0 0 0]    1000;
        k           k  [1 1 -3 -1 0 0 0]    3.0;

        Darcy
        {
            d         d [0 -2 0 0 0 0 0] (1e12 1e12 1e12);
            f         f [0 -1 0 0 0 0 0] (0 0 0);
        }

        diffusivity
        {
            type        fixedDiffusivity;
            diff0       diff0 [0 2 -1 0 0 0 0]  1.3124e-4;
            // ------------------------------------------ //
            //type        porousFSG;
            //Tname       T;
            //pName       p;
            //speciesA    H2;     // diffusing species
            //speciesB    H2O;    // background species
            //porosity    0.5;
            //tortuosity  3.0;
            //dPore       dPore [0 1 0 0 0 0 0] 1.333333e-06;   // pore size
            //doBinary    false;
        }
    }

    afl
    {
        coordinateSystem
        {
            e1        (1 0 0);
            e2        (0 0 1); 
        }

        porosity    0.25;

        Cp          Cp [0 2 -2 -1 0 0 0]    1000;
        k           k  [1 1 -3 -1 0 0 0]    3.0;

        Darcy
        {
            d         d [0 -2 0 0 0 0 0] (1e12 1e12 1e12);
            f         f [0 -1 0 0 0 0 0] (0 0 0);
        }

        diffusivity
        {
            type        fixedDiffusivity;
            diff0       diff0 [0 2 -1 0 0 0 0]  4.6321e-05;
            // ------------------------------------------ //
            //type        porousFSG;
            //Tname       T;
            //pName       p;
            //speciesA    H2;     // diffusing species
            //speciesB    H2O;    // background species
            //porosity    0.25;
            //tortuosity  3.0;
            //dPore       dPore [0 1 0 0 0 0 0] 2.888889e-07;   // pore size
            //doBinary    false;
        }
    }
)
// ************************************************************************* //
