run/quickTestPar/constant/fuel/sofcSpeciesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      sofcSpeciesProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

speciesList
(
    H2
    H2O
);


// name
// molecular weight
// molecular charge (unsigned)
// reaction flag: -1=consumed(reactant), 0=inert, 1=produced(product)
// enthalpy of formation (0 for elements)
// stoichiometric coefficient in electrochemical reaction

H2      H2    2.01594  2  -1  0            130.680;
H2O     H2O  18.01534  2   1  -241.8349e3  188.835;
//      |     |        |   |  |            |
//      |     |        |   |  |            standardEntropy [J/(mol K)
//      |     |        |   |  enthalpyOfFormation [J/mol]
//      |     |        |   produced=1|inert=0|consumed=-1
//      |     |        molecularChargeForFaradaysLaw
//      |    molecularWeight [kg/kmol]
//      name


inertSofcSpecie H2O;   //inert for purposes of mass fraction calculation
                       // not necessarily chemically inert


// molar Cp polynomial coefficients
// from Todd&Young, J. Power Sources 110 (2002) pp 186-200
// [J/(mol K)
//
toddYoung
{
    H2  21.157  56.036  -150.55  199.29  -136.15  46.903  -6.4725;
    H2O 37.373  -41.205  146.01  -217.08  181.54  -79.409  14.015;
}

// ************************************************************************* //

//  N2      N2   28.0134  0   0;
//  N2  29.027  4.8987  -38.040  105.17  -113.56  55.554  -10.350;

