run/quickTestPar/constant/interconnect0/interconnectProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho             rho     [1 -3 0 0 0 0 0]     7900;
Cp              Cp      [0 2 -2 -1 0 0 0]    660;
k               k       [1 1 -3 -1 0 0 0]    24;

// ************************************************************************* //
