run/quickTestPar/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver           PBiCG;
        preconditioner   DILU;
        maxIter          5000;

        //solver           smoothSolver;
        //smoother         GaussSeidel;
        //nSweeps          20;
        //maxIter          50000;

        tolerance        1e-10;
        relTol           0;
        minIter          1;
    }
}


// ************************************************************************* //
